NSX-T Version 3.1.1.0.0.17483185
```
$> terraform version
Terraform v0.15.4
on darwin_amd64
+ provider registry.terraform.io/vmware/nsxt v3.2.2
```

For some context. I had some resources setup by hand via the UI long time ago. Now I am trying to bring those resource under terrafrom management. In other words, i'm creating the resource configuration and then using terraform import to link the resource the configuration. There is also #644 that kind of shows that the import doesn't work for interfaces for some reason. 
Running into this bug for the distribution resource, I opened this bug report. Since I have just deleted the distribution config via the UI and commented out the resource in terrafrom. Ran the apply which worked as expected. Then I uncommented the distribution resource in terraform expecting terraform to just create it rather than importing it. It seems to create it, but still produces the error reported.

I also did the same thing for the interfaces (reported in #644) since they wouldn't import at all (unlike distribution config).

I am now where those resources are to be created with terraform since they were deleted from the UI, but I get this output

```2021-07-12 14:55:45|akhomyakov@ATH050079:~/git/nsxt-terraform
$> terraform plan
module.labnsx101.nsxt_policy_dhcp_relay.BED-LAB-DHCP-SERVER: Refreshing state... [id=BED-LAB-DHCP-SERVER]
module.labnsx101.nsxt_policy_tier0_gateway.BED-LAB-LB-T0-RTR1: Refreshing state... [id=b5c6ee64-2edb-4ba6-a9ef-36d29c48d897]
module.labnsx101.nsxt_policy_tier0_gateway.BED-LAB-T0-DEV-ROUTER: Refreshing state... [id=BED-LAB-T0-ROUTER]
module.labnsx101.nsxt_policy_tier0_gateway.BED-LAB-NAT-T0-RTR1: Refreshing state... [id=e1d81703-53b6-47f7-9c6f-3a5289512eaf]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-DEV-VLAN149: Refreshing state... [id=5d1d9990-2283-4212-8513-c92d4673d929]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-LABS-VLAN659: Refreshing state... [id=7dd68ba8-b2b5-4944-827e-27ea3e8f875d]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-EDI-VLAN459: Refreshing state... [id=1bd1c533-7e6f-46cc-ba03-6ed1bdf8f129]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-EDI-VLAN459: Refreshing state... [id=fa18d537-a3b4-41fc-959f-2187d21b47db]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-VLAN141-DEV: Refreshing state... [id=BED-LAB-F6-VLAN141-DEV]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-IDX-VLAN559: Refreshing state... [id=432cf3a7-acd1-4069-9a74-b0fa284cda2a]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-COMM-VLAN759: Refreshing state... [id=c71c64d9-a5e6-4be5-bedb-20f938d3ddf4]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-PROD-VLAN159: Refreshing state... [id=1793b614-a5fb-488e-86c4-9bb1ecaeb05c]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-PROD-VLAN159: Refreshing state... [id=add0c6cd-ff8b-483e-bff0-6bd155925714]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-INTRZ-VLAN359: Refreshing state... [id=963df32d-fa20-45cf-ada0-dec449a3dbbf]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-LABS-VLAN659: Refreshing state... [id=d28cfd3c-1286-4e4e-bf25-8a04e465ca4f]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-VLAN141-DEV: Refreshing state... [id=BED-LAB-F5-VLAN141-DEV]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-COMM-VLAN759: Refreshing state... [id=0ca0c03c-169b-4869-9385-e89f99d4e592]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-INET-VLAN259: Refreshing state... [id=ad665678-9955-4587-9030-e78aeca21a6d]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-IDX-VLAN559: Refreshing state... [id=76b6d8ad-3e84-4e59-9a18-b0ecabda31fb]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-INTRZ-VLAN359: Refreshing state... [id=ad73409a-6846-4ad2-811e-7df408025bd0]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-DEV-VLAN149: Refreshing state... [id=775e7ba3-c0e4-4bdf-9109-bd1ef5cc23b2]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-INET-VLAN259: Refreshing state... [id=d97ccb45-7983-44e8-a4dd-57451956adb5]
module.labnsx101.nsxt_policy_segment.T0-F5-to-T0-NAT: Refreshing state... [id=09082abe-13c5-4fe4-a54a-5f5a50c681c0]
module.labnsx101.nsxt_policy_segment.T0-F6-to-T0-NAT: Refreshing state... [id=149ddf31-b087-422b-a8ac-374d29629b92]
module.labnsx101.nsxt_policy_gateway_community_list.IDX_ROUTES: Refreshing state... [id=312bf2c2-80a6-4916-97bb-1fbba0bd5ee2]
module.labnsx101.nsxt_policy_gateway_prefix_list.pop-legacy-prefix-list: Refreshing state... [id=bfa4a62e-6b91-455f-b9a0-a585f379334d]
module.labnsx101.nsxt_policy_gateway_community_list.ANYCAST_ROUTES: Refreshing state... [id=a8238421-8ced-49d0-84fd-a07ea9a7f5c7]
module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-LB-T0-RTR1-REDISTRIBUTION: Refreshing state... [id=46150e0f-0e06-40ca-9cf9-7d59c65e7cb6]
module.labnsx101.nsxt_policy_gateway_community_list.DEVELOPMENT_ROUTES: Refreshing state... [id=90765321-d60b-4aa6-8a85-6b0f64135f44]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-IDX: Refreshing state... [id=8df0f24b-3b7a-4f48-a1a9-be0e2c1a3138]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc6598-prefix-list: Refreshing state... [id=a97e5d01-b1cb-4cf9-b87b-8f4b73a9ff10]
module.labnsx101.nsxt_policy_gateway_prefix_list.comm-legacy-prefix-list: Refreshing state... [id=cd36a0bd-4376-4b54-a995-fe06a42f946f]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-LB-VIPs: Refreshing state... [id=09ab832d-4eec-4abc-9a32-6dbf0cf712df]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-INET: Refreshing state... [id=65694ae3-abce-458e-a455-8d3a741c03ba]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-INTRZ: Refreshing state... [id=ac995da1-71a0-49e9-a0f4-aaa48bd98b8e]
module.labnsx101.nsxt_policy_gateway_community_list.INTERZONE_ROUTES: Refreshing state... [id=ed52e350-5315-4014-82d4-a2cd03400b4c]
module.labnsx101.nsxt_policy_gateway_prefix_list.epoc-legacy-prefix-list: Refreshing state... [id=022ff776-63d7-4057-a6d9-493e5bd03680]
module.labnsx101.nsxt_policy_gateway_prefix_list.dev-legacy-prefix-list: Refreshing state... [id=67d57b67-d2a4-49b9-ac30-0c754744d0b5]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-COMM: Refreshing state... [id=6247fce9-b8e5-4db8-a857-e05b12f3c4f2]
module.labnsx101.nsxt_policy_gateway_community_list.LABS_ROUTES: Refreshing state... [id=e44b09ef-62f6-4e01-b863-0edec20c8b82]
module.labnsx101.nsxt_policy_gateway_community_list.COMMUNICATOR_ROUTES: Refreshing state... [id=e6ccdddd-d2f7-4980-85dc-fda1b1ac5713]
module.labnsx101.nsxt_policy_gateway_prefix_list.intrz-legacy-prefix-list: Refreshing state... [id=313009f3-3a6f-47b7-ae88-47ebee9d1bbd]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-LABS: Refreshing state... [id=507c8fd4-bd40-4f9d-8094-0341fc638c8d]
module.labnsx101.nsxt_policy_gateway_community_list.PRODUCTION_ROUTES: Refreshing state... [id=b4a206a7-1eda-4466-aeab-c956c2cc5763]
module.labnsx101.nsxt_policy_gateway_prefix_list.longer_than_16: Refreshing state... [id=c617634f-a200-47d0-b92f-040a43d24a5f]
module.labnsx101.nsxt_policy_gateway_prefix_list.prod-legacy-prefix-list: Refreshing state... [id=dae06ba4-908c-43b8-ae18-5f9b8c86f9ba]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc1918-prefix-list: Refreshing state... [id=7fe33f2d-0d2c-450a-a9e9-c2a4b0898981]
module.labnsx101.nsxt_policy_gateway_community_list.EDI_ROUTES: Refreshing state... [id=66d99688-366b-4bac-a86c-85fb0d18b092]
module.labnsx101.nsxt_policy_gateway_community_list.INTERNET_ROUTES: Refreshing state... [id=1091165a-568d-4e72-82d6-5e3d5582d789]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-EDI: Refreshing state... [id=d890d85c-0524-458b-a161-9fdc54028e7c]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-DEV: Refreshing state... [id=306ed054-2a70-463d-af42-5cbd08a93287]
module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-NAT-T0-RTR1-REDISTRIBUTION: Refreshing state... [id=5a2bee54-68fd-48f2-8dfa-8e9bb1ec74ac]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-PROD: Refreshing state... [id=4c4e6392-7412-4a3b-a970-d536f2a24910]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-LB-VIPs-DEV-ROUTER: Refreshing state... [id=BED-LAB-LB-VIP]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-PROD-AGG-prefix-List: Refreshing state... [id=ED-LAB-PROD-AGG-prefix-List]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-LB-SNATs: Refreshing state... [id=BED-LAB-LB-SNATs]
module.labnsx101.nsxt_policy_gateway_prefix_list.default-route-only-prefix-list: Refreshing state... [id=default-route-only-prefix-list]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-DEV-AGG-prefix-List: Refreshing state... [id=BED-LAB-DEV-AGG-prefix-List]
module.labnsx101.nsxt_policy_gateway_prefix_list.prefixlist-out-default: Refreshing state... [id=prefixlist-out-default]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc6598-prefix-list-DEV-ROUTER: Refreshing state... [id=rfc6598-prefix-list]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN459-F6: Refreshing state... [id=97e3c6d2-19a3-4503-addb-80d67bb7b267]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN659-F6: Refreshing state... [id=be625534-7e49-4c05-a5c5-efc217b6579c]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc1918-prefix-list-DEV-ROUTER: Refreshing state... [id=rfc1918-prefix-list]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN559-F6: Refreshing state... [id=e9d89541-f00f-4602-9ec9-d7511bb796ef]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN149-F6: Refreshing state... [id=6cfed8e8-155d-48a0-bb28-97e86772c68a]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN459-F5: Refreshing state... [id=52199338-6ac9-4a07-9bd3-6aacc519d095]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN159-F6: Refreshing state... [id=e81481ca-cb66-46d2-ba36-8048429acf12]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN759-F5: Refreshing state... [id=c54318be-da99-4d22-80fe-06012eb897a9]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN359-F5: Refreshing state... [id=48b1ec79-b163-4371-a2bc-4eeb89f6f7a4]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN159-F5: Refreshing state... [id=0610a463-cedc-4ab9-b99a-6007b359c14c]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN259-F6: Refreshing state... [id=41655d7a-95c3-4029-b04c-03a478765fb3]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN659-F5: Refreshing state... [id=b76e41c9-b1e2-4657-9517-b7befd2c8885]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN759-F6: Refreshing state... [id=34d00139-a02a-4b2b-b876-15c7bc12e2f1]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN359-F6: Refreshing state... [id=bee3734e-9c4c-4bdc-af3f-71b2675caf18]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN149-F5: Refreshing state... [id=8a07426a-310c-404c-9c0c-7bfa1956678c]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN259-F5: Refreshing state... [id=1ba03010-defe-4e01-83fb-2ba1c03b1a1f]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-IDX: Refreshing state... [id=4c556446-b5c9-439b-af58-6f91c47ce38e]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-INTRZ: Refreshing state... [id=cb4a6014-cd66-4205-9f68-a5e00f1e4cb6]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-DEV: Refreshing state... [id=a3041de3-9ecf-47e1-ab96-8bd595dd7bd9]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN559-F5: Refreshing state... [id=c923050b-ebe7-4a48-b189-ab5aa21bef04]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-INET: Refreshing state... [id=43b0a6a6-81ee-4872-b95a-02fc111ceec5]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-PROD: Refreshing state... [id=d49e360e-e2f6-4ba6-bd78-4c93da40a273]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-LABS: Refreshing state... [id=96a4a1fa-09ff-432c-9fd4-22f914c8b075]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-COMM: Refreshing state... [id=b8c455bd-4548-4a56-8b78-44b65b4aba50]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-EDI: Refreshing state... [id=e9ed4078-4eef-4c2e-b32e-f9cc7e476dcc]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-OUT-TO-DEV: Refreshing state... [id=BED-LAB-OUT-TO-DEV]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-IN-FROM-DEV: Refreshing state... [id=BED-LAB-IN-FROM-DEV]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan359: Refreshing state... [id=bbb270ca-d050-4ffd-a464-1e422a1adf43]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan359: Refreshing state... [id=b413fbaf-8920-4c40-9e3a-6de301aea1db]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan359: Refreshing state... [id=1ba49ea5-3439-41fe-92cc-c8398885c1a8]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan359: Refreshing state... [id=7b7cd28e-6463-4991-865e-955e44408999]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan559: Refreshing state... [id=ee23a527-e87b-4796-a327-86bb87633d9d]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan559: Refreshing state... [id=3fa5b6a8-92c6-4846-b0a6-a997712c3cec]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan559: Refreshing state... [id=8a55f306-e8ec-46d6-a2c3-ea2a6043b4a5]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan559: Refreshing state... [id=bf990e1e-c457-4493-abca-ad2b18cfd8df]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan149: Refreshing state... [id=6b3be2c1-1b12-43fb-b02d-5c7b451f52f7]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan149: Refreshing state... [id=a42adeda-588d-48c7-bc0d-fc2f393ffaca]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan659: Refreshing state... [id=08721ef2-ea5f-4c5b-bfce-79adbaea2444]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan149: Refreshing state... [id=2284af0b-7062-4c65-88b5-837f1df61936]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan659: Refreshing state... [id=c35e80a7-82af-4d56-bc45-68ec9db36f00]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan659: Refreshing state... [id=9f0f3cdc-9b71-4b6e-bca1-b863df890eb4]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan149: Refreshing state... [id=ffe70beb-7bb4-43c6-a429-7fdc25c026e9]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan659: Refreshing state... [id=ce314de0-b180-49b8-bd47-81e26ecfd23e]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan259: Refreshing state... [id=b52973ae-1457-48e1-b949-61e650a469ed]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan259: Refreshing state... [id=0e57c720-13e8-4291-986e-b8eac4c20de1]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan259: Refreshing state... [id=5bab7011-46ce-45e1-8443-f1de9e4ab2d8]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan259: Refreshing state... [id=8e8c82bc-c747-451f-90de-2fd4565a0978]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan159: Refreshing state... [id=9ff2b3f4-c01e-4e94-93a8-7187cd190063]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan159: Refreshing state... [id=dcf4ad1e-aa22-42f1-a813-71855e5f6602]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan159: Refreshing state... [id=225d7399-d904-4620-aa33-1cdc419e60b5]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan159: Refreshing state... [id=e732fb94-b572-4a1b-bc3f-afb48be8942e]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan759: Refreshing state... [id=8d0d5c3d-c8fe-416f-bf9d-7409977900d2]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan759: Refreshing state... [id=fc9756c3-56b8-400b-b76d-feed75998530]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan759: Refreshing state... [id=98fe94ca-626a-412b-8b2c-05c3d146f0d6]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan759: Refreshing state... [id=43c7db75-2189-4fa4-9d1d-0b747876faa1]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan459: Refreshing state... [id=904718b1-46a4-4fb5-aaa3-c3d49a2ab704]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan459: Refreshing state... [id=8d62aa11-c49a-44a7-99ef-da922ba0f192]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan459: Refreshing state... [id=376aa270-e083-4bc7-918e-eb6492a8c849]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan459: Refreshing state... [id=203cabe9-9a32-4215-a60a-68ba3cc807ea]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these
changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF5a-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF5a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.232.253"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009981"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF5b-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF5a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.232.252"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009982"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF6a-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF6a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.233.253"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009983"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF6b-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF6a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.233.252"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009984"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION will be created
  + resource "nsxt_policy_gateway_redistribution_config" "BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION" {
      + bgp_enabled       = true
      + gateway_id        = (known after apply)
      + gateway_path      = "/infra/tier-0s/BED-LAB-T0-ROUTER"
      + id                = (known after apply)
      + locale_service_id = (known after apply)
      + ospf_enabled      = false

      + rule {
          + name  = "BGP"
          + types = [
              + "TIER1_CONNECTED",
              + "TIER1_LB_SNAT",
              + "TIER1_LB_VIP",
              + "TIER1_NAT",
            ]
        }
    }

  # module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F5 will be created
  + resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F5" {
      + display_name           = "VLAN141-F5"
      + edge_node_path         = "/infra/sites/default/enforcement-points/default/edge-clusters/314ebf68-f244-47ed-9359-8ca40736dedb/edge-nodes/863854bf-146c-40b6-acbc-31ff959d4ec7"
      + enable_pim             = false
      + gateway_path           = "/infra/tier-0s/BED-LAB-T0-ROUTER"
      + id                     = (known after apply)
      + ip_addresses           = (known after apply)
      + ipv6_ndra_profile_path = (known after apply)
      + locale_service_id      = (known after apply)
      + mtu                    = 9000
      + nsx_id                 = (known after apply)
      + path                   = (known after apply)
      + revision               = (known after apply)
      + segment_path           = "/infra/segments/BED-LAB-F5-VLAN141-DEV"
      + subnets                = [
          + "10.101.232.1/24",
        ]
      + type                   = "EXTERNAL"
      + urpf_mode              = "STRICT"
    }

  # module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F6 will be created
  + resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F6" {
      + display_name           = "VLAN141-F6"
      + edge_node_path         = "/infra/sites/default/enforcement-points/default/edge-clusters/314ebf68-f244-47ed-9359-8ca40736dedb/edge-nodes/1c513699-b288-4c99-8dd7-14eec17689e3"
      + enable_pim             = false
      + gateway_path           = "/infra/tier-0s/BED-LAB-T0-ROUTER"
      + id                     = (known after apply)
      + ip_addresses           = (known after apply)
      + ipv6_ndra_profile_path = (known after apply)
      + locale_service_id      = (known after apply)
      + mtu                    = 9000
      + nsx_id                 = (known after apply)
      + path                   = (known after apply)
      + revision               = (known after apply)
      + segment_path           = "/infra/segments/BED-LAB-F6-VLAN141-DEV"
      + subnets                = [
          + "10.101.233.1/24",
        ]
      + type                   = "EXTERNAL"
      + urpf_mode              = "STRICT"
    }

Plan: 7 to add, 0 to change, 0 to destroy.
```
```
2021-07-12 15:02:40|akhomyakov@ATH050079:~/git/nsxt-terraform
$> terraform apply
module.labnsx101.nsxt_policy_dhcp_relay.BED-LAB-DHCP-SERVER: Refreshing state... [id=BED-LAB-DHCP-SERVER]
module.labnsx101.nsxt_policy_tier0_gateway.BED-LAB-LB-T0-RTR1: Refreshing state... [id=b5c6ee64-2edb-4ba6-a9ef-36d29c48d897]
module.labnsx101.nsxt_policy_tier0_gateway.BED-LAB-NAT-T0-RTR1: Refreshing state... [id=e1d81703-53b6-47f7-9c6f-3a5289512eaf]
module.labnsx101.nsxt_policy_tier0_gateway.BED-LAB-T0-DEV-ROUTER: Refreshing state... [id=BED-LAB-T0-ROUTER]
module.labnsx101.nsxt_policy_segment.T0-F5-to-T0-NAT: Refreshing state... [id=09082abe-13c5-4fe4-a54a-5f5a50c681c0]
module.labnsx101.nsxt_policy_segment.T0-F6-to-T0-NAT: Refreshing state... [id=149ddf31-b087-422b-a8ac-374d29629b92]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-PROD-VLAN159: Refreshing state... [id=1793b614-a5fb-488e-86c4-9bb1ecaeb05c]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-VLAN141-DEV: Refreshing state... [id=BED-LAB-F6-VLAN141-DEV]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-INTRZ-VLAN359: Refreshing state... [id=963df32d-fa20-45cf-ada0-dec449a3dbbf]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-EDI-VLAN459: Refreshing state... [id=1bd1c533-7e6f-46cc-ba03-6ed1bdf8f129]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-VLAN141-DEV: Refreshing state... [id=BED-LAB-F5-VLAN141-DEV]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-PROD-VLAN159: Refreshing state... [id=add0c6cd-ff8b-483e-bff0-6bd155925714]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-LABS-VLAN659: Refreshing state... [id=d28cfd3c-1286-4e4e-bf25-8a04e465ca4f]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-IDX-VLAN559: Refreshing state... [id=432cf3a7-acd1-4069-9a74-b0fa284cda2a]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-DEV-VLAN149: Refreshing state... [id=775e7ba3-c0e4-4bdf-9109-bd1ef5cc23b2]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-INET-VLAN259: Refreshing state... [id=ad665678-9955-4587-9030-e78aeca21a6d]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-INET-VLAN259: Refreshing state... [id=d97ccb45-7983-44e8-a4dd-57451956adb5]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-DEV-VLAN149: Refreshing state... [id=5d1d9990-2283-4212-8513-c92d4673d929]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-COMM-VLAN759: Refreshing state... [id=0ca0c03c-169b-4869-9385-e89f99d4e592]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-LABS-VLAN659: Refreshing state... [id=7dd68ba8-b2b5-4944-827e-27ea3e8f875d]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F6-INTRZ-VLAN359: Refreshing state... [id=ad73409a-6846-4ad2-811e-7df408025bd0]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-COMM-VLAN759: Refreshing state... [id=c71c64d9-a5e6-4be5-bedb-20f938d3ddf4]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-EDI-VLAN459: Refreshing state... [id=fa18d537-a3b4-41fc-959f-2187d21b47db]
module.labnsx101.nsxt_policy_vlan_segment.BED-LAB-F5-IDX-VLAN559: Refreshing state... [id=76b6d8ad-3e84-4e59-9a18-b0ecabda31fb]
module.labnsx101.nsxt_policy_gateway_prefix_list.intrz-legacy-prefix-list: Refreshing state... [id=313009f3-3a6f-47b7-ae88-47ebee9d1bbd]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc6598-prefix-list: Refreshing state... [id=a97e5d01-b1cb-4cf9-b87b-8f4b73a9ff10]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-DEV: Refreshing state... [id=306ed054-2a70-463d-af42-5cbd08a93287]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-INTRZ: Refreshing state... [id=ac995da1-71a0-49e9-a0f4-aaa48bd98b8e]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-EDI: Refreshing state... [id=d890d85c-0524-458b-a161-9fdc54028e7c]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-COMM: Refreshing state... [id=6247fce9-b8e5-4db8-a857-e05b12f3c4f2]
module.labnsx101.nsxt_policy_gateway_prefix_list.epoc-legacy-prefix-list: Refreshing state... [id=022ff776-63d7-4057-a6d9-493e5bd03680]
module.labnsx101.nsxt_policy_gateway_prefix_list.pop-legacy-prefix-list: Refreshing state... [id=bfa4a62e-6b91-455f-b9a0-a585f379334d]
module.labnsx101.nsxt_policy_gateway_prefix_list.prod-legacy-prefix-list: Refreshing state... [id=dae06ba4-908c-43b8-ae18-5f9b8c86f9ba]
module.labnsx101.nsxt_policy_gateway_community_list.INTERNET_ROUTES: Refreshing state... [id=1091165a-568d-4e72-82d6-5e3d5582d789]
module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-LB-T0-RTR1-REDISTRIBUTION: Refreshing state... [id=46150e0f-0e06-40ca-9cf9-7d59c65e7cb6]
module.labnsx101.nsxt_policy_gateway_community_list.COMMUNICATOR_ROUTES: Refreshing state... [id=e6ccdddd-d2f7-4980-85dc-fda1b1ac5713]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-PROD: Refreshing state... [id=4c4e6392-7412-4a3b-a970-d536f2a24910]
module.labnsx101.nsxt_policy_gateway_community_list.INTERZONE_ROUTES: Refreshing state... [id=ed52e350-5315-4014-82d4-a2cd03400b4c]
module.labnsx101.nsxt_policy_gateway_community_list.LABS_ROUTES: Refreshing state... [id=e44b09ef-62f6-4e01-b863-0edec20c8b82]
module.labnsx101.nsxt_policy_gateway_community_list.ANYCAST_ROUTES: Refreshing state... [id=a8238421-8ced-49d0-84fd-a07ea9a7f5c7]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-IDX: Refreshing state... [id=8df0f24b-3b7a-4f48-a1a9-be0e2c1a3138]
module.labnsx101.nsxt_policy_gateway_community_list.PRODUCTION_ROUTES: Refreshing state... [id=b4a206a7-1eda-4466-aeab-c956c2cc5763]
module.labnsx101.nsxt_policy_gateway_community_list.DEVELOPMENT_ROUTES: Refreshing state... [id=90765321-d60b-4aa6-8a85-6b0f64135f44]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-INET: Refreshing state... [id=65694ae3-abce-458e-a455-8d3a741c03ba]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc1918-prefix-list: Refreshing state... [id=7fe33f2d-0d2c-450a-a9e9-c2a4b0898981]
module.labnsx101.nsxt_policy_gateway_community_list.EDI_ROUTES: Refreshing state... [id=66d99688-366b-4bac-a86c-85fb0d18b092]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-IN-FROM-LABS: Refreshing state... [id=507c8fd4-bd40-4f9d-8094-0341fc638c8d]
module.labnsx101.nsxt_policy_gateway_prefix_list.comm-legacy-prefix-list: Refreshing state... [id=cd36a0bd-4376-4b54-a995-fe06a42f946f]
module.labnsx101.nsxt_policy_gateway_community_list.IDX_ROUTES: Refreshing state... [id=312bf2c2-80a6-4916-97bb-1fbba0bd5ee2]
module.labnsx101.nsxt_policy_gateway_prefix_list.longer_than_16: Refreshing state... [id=c617634f-a200-47d0-b92f-040a43d24a5f]
module.labnsx101.nsxt_policy_gateway_prefix_list.dev-legacy-prefix-list: Refreshing state... [id=67d57b67-d2a4-49b9-ac30-0c754744d0b5]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-LB-VIPs: Refreshing state... [id=09ab832d-4eec-4abc-9a32-6dbf0cf712df]
module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-NAT-T0-RTR1-REDISTRIBUTION: Refreshing state... [id=5a2bee54-68fd-48f2-8dfa-8e9bb1ec74ac]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc6598-prefix-list-DEV-ROUTER: Refreshing state... [id=rfc6598-prefix-list]
module.labnsx101.nsxt_policy_gateway_prefix_list.prefixlist-out-default: Refreshing state... [id=prefixlist-out-default]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-DEV-AGG-prefix-List: Refreshing state... [id=BED-LAB-DEV-AGG-prefix-List]
module.labnsx101.nsxt_policy_gateway_prefix_list.default-route-only-prefix-list: Refreshing state... [id=default-route-only-prefix-list]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-PROD-AGG-prefix-List: Refreshing state... [id=ED-LAB-PROD-AGG-prefix-List]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-LB-SNATs: Refreshing state... [id=BED-LAB-LB-SNATs]
module.labnsx101.nsxt_policy_gateway_prefix_list.BED-LAB-LB-VIPs-DEV-ROUTER: Refreshing state... [id=BED-LAB-LB-VIP]
module.labnsx101.nsxt_policy_gateway_prefix_list.rfc1918-prefix-list-DEV-ROUTER: Refreshing state... [id=rfc1918-prefix-list]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN459-F6: Refreshing state... [id=97e3c6d2-19a3-4503-addb-80d67bb7b267]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN159-F6: Refreshing state... [id=e81481ca-cb66-46d2-ba36-8048429acf12]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN359-F5: Refreshing state... [id=48b1ec79-b163-4371-a2bc-4eeb89f6f7a4]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN559-F6: Refreshing state... [id=e9d89541-f00f-4602-9ec9-d7511bb796ef]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN159-F5: Refreshing state... [id=0610a463-cedc-4ab9-b99a-6007b359c14c]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN659-F5: Refreshing state... [id=b76e41c9-b1e2-4657-9517-b7befd2c8885]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN149-F5: Refreshing state... [id=8a07426a-310c-404c-9c0c-7bfa1956678c]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN259-F6: Refreshing state... [id=41655d7a-95c3-4029-b04c-03a478765fb3]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN149-F6: Refreshing state... [id=6cfed8e8-155d-48a0-bb28-97e86772c68a]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN259-F5: Refreshing state... [id=1ba03010-defe-4e01-83fb-2ba1c03b1a1f]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN659-F6: Refreshing state... [id=be625534-7e49-4c05-a5c5-efc217b6579c]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN359-F6: Refreshing state... [id=bee3734e-9c4c-4bdc-af3f-71b2675caf18]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN759-F6: Refreshing state... [id=34d00139-a02a-4b2b-b876-15c7bc12e2f1]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN459-F5: Refreshing state... [id=52199338-6ac9-4a07-9bd3-6aacc519d095]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN759-F5: Refreshing state... [id=c54318be-da99-4d22-80fe-06012eb897a9]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN559-F5: Refreshing state... [id=c923050b-ebe7-4a48-b189-ab5aa21bef04]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-DEV: Refreshing state... [id=a3041de3-9ecf-47e1-ab96-8bd595dd7bd9]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-INTRZ: Refreshing state... [id=cb4a6014-cd66-4205-9f68-a5e00f1e4cb6]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-INET: Refreshing state... [id=43b0a6a6-81ee-4872-b95a-02fc111ceec5]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-PROD: Refreshing state... [id=d49e360e-e2f6-4ba6-bd78-4c93da40a273]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-LABS: Refreshing state... [id=96a4a1fa-09ff-432c-9fd4-22f914c8b075]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-IDX: Refreshing state... [id=4c556446-b5c9-439b-af58-6f91c47ce38e]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-COMM: Refreshing state... [id=b8c455bd-4548-4a56-8b78-44b65b4aba50]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-LB-OUT-TO-EDI: Refreshing state... [id=e9ed4078-4eef-4c2e-b32e-f9cc7e476dcc]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-IN-FROM-DEV: Refreshing state... [id=BED-LAB-IN-FROM-DEV]
module.labnsx101.nsxt_policy_gateway_route_map.BED-LAB-OUT-TO-DEV: Refreshing state... [id=BED-LAB-OUT-TO-DEV]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan149: Refreshing state... [id=2284af0b-7062-4c65-88b5-837f1df61936]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan149: Refreshing state... [id=6b3be2c1-1b12-43fb-b02d-5c7b451f52f7]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan149: Refreshing state... [id=ffe70beb-7bb4-43c6-a429-7fdc25c026e9]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan149: Refreshing state... [id=a42adeda-588d-48c7-bc0d-fc2f393ffaca]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan659: Refreshing state... [id=c35e80a7-82af-4d56-bc45-68ec9db36f00]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan659: Refreshing state... [id=9f0f3cdc-9b71-4b6e-bca1-b863df890eb4]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan659: Refreshing state... [id=08721ef2-ea5f-4c5b-bfce-79adbaea2444]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan659: Refreshing state... [id=ce314de0-b180-49b8-bd47-81e26ecfd23e]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan359: Refreshing state... [id=1ba49ea5-3439-41fe-92cc-c8398885c1a8]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan359: Refreshing state... [id=7b7cd28e-6463-4991-865e-955e44408999]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan359: Refreshing state... [id=b413fbaf-8920-4c40-9e3a-6de301aea1db]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan359: Refreshing state... [id=bbb270ca-d050-4ffd-a464-1e422a1adf43]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan259: Refreshing state... [id=0e57c720-13e8-4291-986e-b8eac4c20de1]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan259: Refreshing state... [id=b52973ae-1457-48e1-b949-61e650a469ed]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan259: Refreshing state... [id=5bab7011-46ce-45e1-8443-f1de9e4ab2d8]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan259: Refreshing state... [id=8e8c82bc-c747-451f-90de-2fd4565a0978]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan159: Refreshing state... [id=225d7399-d904-4620-aa33-1cdc419e60b5]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan159: Refreshing state... [id=9ff2b3f4-c01e-4e94-93a8-7187cd190063]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan159: Refreshing state... [id=e732fb94-b572-4a1b-bc3f-afb48be8942e]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan159: Refreshing state... [id=dcf4ad1e-aa22-42f1-a813-71855e5f6602]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan559: Refreshing state... [id=ee23a527-e87b-4796-a327-86bb87633d9d]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan559: Refreshing state... [id=bf990e1e-c457-4493-abca-ad2b18cfd8df]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan559: Refreshing state... [id=8a55f306-e8ec-46d6-a2c3-ea2a6043b4a5]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan559: Refreshing state... [id=3fa5b6a8-92c6-4846-b0a6-a997712c3cec]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan759: Refreshing state... [id=98fe94ca-626a-412b-8b2c-05c3d146f0d6]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan759: Refreshing state... [id=8d0d5c3d-c8fe-416f-bf9d-7409977900d2]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan759: Refreshing state... [id=43c7db75-2189-4fa4-9d1d-0b747876faa1]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan759: Refreshing state... [id=fc9756c3-56b8-400b-b76d-feed75998530]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan459: Refreshing state... [id=904718b1-46a4-4fb5-aaa3-c3d49a2ab704]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan459: Refreshing state... [id=203cabe9-9a32-4215-a60a-68ba3cc807ea]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan459: Refreshing state... [id=376aa270-e083-4bc7-918e-eb6492a8c849]
module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan459: Refreshing state... [id=8d62aa11-c49a-44a7-99ef-da922ba0f192]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply":


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these
changes.

────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5a-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF5a-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF5a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.232.253"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009981"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF5b-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF5b-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF5a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.232.252"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009982"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6a-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF6a-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF6a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.233.253"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009983"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_bgp_neighbor.bed-lab-fwF6b-vlan141 will be created
  + resource "nsxt_policy_bgp_neighbor" "bed-lab-fwF6b-vlan141" {
      + allow_as_in           = false
      + bgp_path              = "/infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/bgp"
      + display_name          = "bed-lab-fwF6a-vlan141"
      + graceful_restart_mode = "HELPER_ONLY"
      + hold_down_time        = 180
      + id                    = (known after apply)
      + keep_alive_time       = 60
      + maximum_hop_limit     = 1
      + neighbor_address      = "10.101.233.252"
      + nsx_id                = (known after apply)
      + path                  = (known after apply)
      + remote_as_num         = "4200009984"
      + revision              = (known after apply)
      + source_addresses      = (known after apply)

      + bfd_config {
          + enabled  = true
          + interval = 500
          + multiple = 3
        }

      + route_filtering {
          + address_family   = "IPV4"
          + enabled          = true
          + in_route_filter  = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-IN-FROM-DEV"
          + out_route_filter = "/infra/tier-0s/BED-LAB-T0-ROUTER/route-maps/BED-LAB-OUT-TO-DEV"
        }
    }

  # module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION will be created
  + resource "nsxt_policy_gateway_redistribution_config" "BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION" {
      + bgp_enabled       = true
      + gateway_id        = (known after apply)
      + gateway_path      = "/infra/tier-0s/BED-LAB-T0-ROUTER"
      + id                = (known after apply)
      + locale_service_id = (known after apply)
      + ospf_enabled      = false

      + rule {
          + name  = "BGP"
          + types = [
              + "TIER1_CONNECTED",
              + "TIER1_LB_SNAT",
              + "TIER1_LB_VIP",
              + "TIER1_NAT",
            ]
        }
    }

  # module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F5 will be created
  + resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F5" {
      + display_name           = "VLAN141-F5"
      + edge_node_path         = "/infra/sites/default/enforcement-points/default/edge-clusters/314ebf68-f244-47ed-9359-8ca40736dedb/edge-nodes/863854bf-146c-40b6-acbc-31ff959d4ec7"
      + enable_pim             = false
      + gateway_path           = "/infra/tier-0s/BED-LAB-T0-ROUTER"
      + id                     = (known after apply)
      + ip_addresses           = (known after apply)
      + ipv6_ndra_profile_path = (known after apply)
      + locale_service_id      = (known after apply)
      + mtu                    = 9000
      + nsx_id                 = (known after apply)
      + path                   = (known after apply)
      + revision               = (known after apply)
      + segment_path           = "/infra/segments/BED-LAB-F5-VLAN141-DEV"
      + subnets                = [
          + "10.101.232.1/24",
        ]
      + type                   = "EXTERNAL"
      + urpf_mode              = "STRICT"
    }

  # module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F6 will be created
  + resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F6" {
      + display_name           = "VLAN141-F6"
      + edge_node_path         = "/infra/sites/default/enforcement-points/default/edge-clusters/314ebf68-f244-47ed-9359-8ca40736dedb/edge-nodes/1c513699-b288-4c99-8dd7-14eec17689e3"
      + enable_pim             = false
      + gateway_path           = "/infra/tier-0s/BED-LAB-T0-ROUTER"
      + id                     = (known after apply)
      + ip_addresses           = (known after apply)
      + ipv6_ndra_profile_path = (known after apply)
      + locale_service_id      = (known after apply)
      + mtu                    = 9000
      + nsx_id                 = (known after apply)
      + path                   = (known after apply)
      + revision               = (known after apply)
      + segment_path           = "/infra/segments/BED-LAB-F6-VLAN141-DEV"
      + subnets                = [
          + "10.101.233.1/24",
        ]
      + type                   = "EXTERNAL"
      + urpf_mode              = "STRICT"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F5: Creating...
module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION: Creating...
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F6: Creating...
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F5: Still creating... [10s elapsed]
module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION: Still creating... [10s elapsed]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F6: Still creating... [10s elapsed]
module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION: Still creating... [20s elapsed]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F6: Still creating... [20s elapsed]
module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F5: Still creating... [20s elapsed]
╷
│ Error: Provider produced inconsistent result after apply
│
│ When applying changes to module.labnsx101.nsxt_policy_gateway_redistribution_config.BED-LAB-T0-DEV-ROUTER-REDISTRIBUTION, provider
│ "module.labnsx101.provider[\"registry.terraform.io/vmware/nsxt\"]" produced an unexpected new value: Root resource was present, but now absent.
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
╷
│ Error:  Failed to create Tier0 Interface 209d0e63-91e7-4117-afc4-5525502b3b0c: Segment /infra/segments/BED-LAB-F5-VLAN141-DEV is already attached to interface /infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/interfaces/da77a881-62ec-4ec2-b03b-6954bc5d43d7. (code 503101)
│
│   with module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F5,
│   on labnsx101/BED-LAB-T0-DEV-ROUTER-interface.tf line 1, in resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F5":
│    1: resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F5" {
│
╵
╷
│ Error:  Failed to create Tier0 Interface d35d2afe-085f-4035-884f-0f71a3e3c2cc: Segment /infra/segments/BED-LAB-F6-VLAN141-DEV is already attached to interface /infra/tier-0s/BED-LAB-T0-ROUTER/locale-services/6e583c30-fce8-11ea-a8f0-97094879d1e7/interfaces/d67f5639-f1ec-4a2c-abde-a9e1b1736981. (code 503101)
│
│   with module.labnsx101.nsxt_policy_tier0_gateway_interface.VLAN141-F6,
│   on labnsx101/BED-LAB-T0-DEV-ROUTER-interface.tf line 15, in resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F6":
│   15: resource "nsxt_policy_tier0_gateway_interface" "VLAN141-F6" {
│
╵
```